TexasInstruments/motor-control-sdk/examples/position_sense/endat3_diagnostic/single_channel/am263px-lp/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --part "AM263P4" --package "ZCZ_C" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@2025.00.00" --product "INDUSTRIAL_COMMUNICATIONS_SDK@2025.00.00" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM263P4" --package "NFBGA (ZCZ-C)" --context "r5fss0-0" --product "MOTOR_CONTROL_SDK@2025.00.00" --product "INDUSTRIAL_COMMUNICATIONS_SDK@2025.00.00" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.25.0+4268"}
 */

/**
 * Import the modules used in this configuration.
 */
const ioexp               = scripting.addModule("/board/ioexp/ioexp", {}, false);
const ioexp1              = ioexp.addInstance();
const epwm                = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1               = epwm.addInstance();
const i2c                 = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1                = i2c.addInstance();
const pruicss             = scripting.addModule("/drivers/pruicss/pruicss", {}, false);
const pruicss1            = pruicss.addInstance();
const clock               = scripting.addModule("/kernel/dpl/clock");
const debug_log           = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg             = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7           = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71          = mpu_armv7.addInstance();
const mpu_armv72          = mpu_armv7.addInstance();
const mpu_armv73          = mpu_armv7.addInstance();
const mpu_armv74          = mpu_armv7.addInstance();
const mpu_armv75          = mpu_armv7.addInstance();
const mpu_armv76          = mpu_armv7.addInstance();
const default_linker      = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1     = default_linker.addInstance();
const general             = scripting.addModule("/memory_configurator/general", {}, false);
const general1            = general.addInstance();
const region              = scripting.addModule("/memory_configurator/region", {}, false);
const region1             = region.addInstance();
const section             = scripting.addModule("/memory_configurator/section", {}, false);
const section1            = section.addInstance();
const section2            = section.addInstance();
const section3            = section.addInstance();
const section4            = section.addInstance();
const section5            = section.addInstance();
const section6            = section.addInstance();
const section7            = section.addInstance();
const section8            = section.addInstance();
const section9            = section.addInstance();
const section10           = section.addInstance();
const section11           = section.addInstance();
const section12           = section.addInstance();
const section13           = section.addInstance();
const endat3              = scripting.addModule("/position_sense/endat3", {}, false);
const endat31             = endat3.addInstance();
const epwm_syncout_xbar   = scripting.addModule("/xbar/epwm_syncout_xbar/epwm_syncout_xbar", {}, false);
const epwm_syncout_xbar1  = epwm_syncout_xbar.addInstance();
const soc_timesync_xbar1  = scripting.addModule("/xbar/soc_timesync_xbar1/soc_timesync_xbar1", {}, false);
const soc_timesync_xbar11 = soc_timesync_xbar1.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
epwm1.$name                         = "CONFIG_EPWM0";
epwm1.epwmTimebase_period           = 25000;
epwm1.epwmTimebase_counterMode      = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.epwmTimebase_syncOutPulseMode = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm1.EPWM.$assign                  = "EPWM0";

ioexp1.$name                                          = "CONFIG_IOEXP0";
ioexp1.i2cAddress                                     = "LP-E2 0x20";
ioexp1.TCA6416ARTWR_port0_pinAM263P_BP_MUX_SEL_mode   = 0;
ioexp1.TCA6416ARTWR_port0_pinAM263P_BP_MUX_SEL_state  = 1;
ioexp1.TCA6416ARTWR_port0_pinAM263P_PRU_MUX_SEL_mode  = 0;
ioexp1.TCA6416ARTWR_port0_pinAM263P_PRU_MUX_SEL_state = 1;

i2c1.$name              = "CONFIG_I2C0";
ioexp1.peripheralDriver = i2c1;
i2c1.I2C.$assign        = "I2C1";
i2c1.I2C_child.$name    = "drivers_i2c_v1_i2c_v1_template0";

const soc_ctrl_adc    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_adc", {}, false);
const soc_ctrl_adc1   = soc_ctrl_adc.addInstance({}, false);
soc_ctrl_adc1.$name   = "soc_ctrl_adc0";
const soc_ctrl        = scripting.addModule("/drivers/soc_ctrl/soc_ctrl", {}, false);
soc_ctrl.soc_ctrl_adc = soc_ctrl_adc1;

const soc_ctrl_cmpss    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_cmpss", {}, false);
const soc_ctrl_cmpss1   = soc_ctrl_cmpss.addInstance({}, false);
soc_ctrl_cmpss1.$name   = "soc_ctrl_cmpss0";
soc_ctrl.soc_ctrl_cmpss = soc_ctrl_cmpss1;

const soc_ctrl_ecap    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_ecap", {}, false);
const soc_ctrl_ecap1   = soc_ctrl_ecap.addInstance({}, false);
soc_ctrl_ecap1.$name   = "soc_ctrl_ecap0";
soc_ctrl.soc_ctrl_ecap = soc_ctrl_ecap1;

const soc_ctrl_epwm    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_epwm", {}, false);
const soc_ctrl_epwm1   = soc_ctrl_epwm.addInstance({}, false);
soc_ctrl_epwm1.$name   = "soc_ctrl_epwm0";
epwm.epwmTbClkSync     = soc_ctrl_epwm1;
soc_ctrl.soc_ctrl_epwm = soc_ctrl_epwm1;

const soc_ctrl_sdfm    = scripting.addModule("/drivers/soc_ctrl/v0/subModules/soc_ctrl_sdfm", {}, false);
const soc_ctrl_sdfm1   = soc_ctrl_sdfm.addInstance({}, false);
soc_ctrl_sdfm1.$name   = "soc_ctrl_sdfm0";
soc_ctrl.soc_ctrl_sdfm = soc_ctrl_sdfm1;

debug_log.enableUartLog            = true;
debug_log.enableSharedMemLog       = true;
debug_log.enableCssLog             = false;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

