TexasInstruments/motor-control-sdk/examples/position_sense/endat3_diagnostic/single_channel/am263px-lp/r5fss0-0_freertos/example.syscfg
section13.$name                       = "Command Rresponse";
section13.load_memory                 = "R5F_TCMB";
section13.output_section.create(1);
section13.output_section[0].$name     = ".gEnDatChInfo";
section13.output_section[0].alignment = 4;

endat31.$name                  = "CONFIG_ENDAT3_0";
endat31.channel_1              = true;
endat31.channel_0              = false;
endat31.Booster_Pack           = true;
endat31.PRU_Slice              = "PRU0";
endat31.ENC1_EN.$name          = "ENC1_EN";
endat31.ENC1_EN.GPIO_n.$assign = "SDFM0_D1";
endat31["PRU-ICSS"].$assign    = "PRU-ICSS";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
endat31.pru                              = pruicss1;
pruicss1.iepClk                          = 200000000;
pruicss1.coreClk                         = 200000000;
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";
pruicss1.intcMapping.create(3);
pruicss1.intcMapping[0].$name            = "CONFIG_ICSS0_INTC_MAPPING0";
pruicss1.intcMapping[0].event            = "18";
pruicss1.intcMapping[1].$name            = "CONFIG_ICSS0_INTC_MAPPING1";
pruicss1.intcMapping[1].event            = "19";
pruicss1.intcMapping[1].host             = "3";
pruicss1.intcMapping[1].channel          = "3";
pruicss1.intcMapping[2].$name            = "CONFIG_ICSS0_INTC_MAPPING2";
pruicss1.intcMapping[2].event            = "20";
pruicss1.intcMapping[2].channel          = "4";

epwm_syncout_xbar1.$name      = "CONFIG_EPWM_SYNCOUT_XBAR0";
epwm_syncout_xbar1.xbarOutput = ["EPWM0_SYNCOUT"];

soc_timesync_xbar11.$name      = "CONFIG_SOC_TIMESYNC_XBAR1_0";
soc_timesync_xbar11.xbarOutput = "SOC_TIMESYNC_XBAR1_PWM_SYNCOUT_XBAR_OUT_0";
soc_timesync_xbar11.instance   = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution                        = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution                        = "EPWM0_B";
i2c1.I2C.SCL.$suggestSolution                        = "I2C1_SCL";
i2c1.I2C.SDA.$suggestSolution                        = "I2C1_SDA";
endat31["PRU-ICSS"].PR0_PRU0_GPIO5.$suggestSolution  = "PR0_PRU0_GPIO5";
endat31["PRU-ICSS"].PR0_PRU0_GPIO4.$suggestSolution  = "PR0_PRU0_GPIO4";
endat31["PRU-ICSS"].PR0_PRU0_GPIO3.$suggestSolution  = "PR0_PRU0_GPIO3";
endat31["PRU-ICSS"].PR0_PRU0_GPIO10.$suggestSolution = "PR0_PRU0_GPIO10";
